app/Controllers/Auth/AccountController.php

SELECT COUNT(*) AS `numrows` FROM `m_customer`
SELECT COUNT(*) AS `numrows` FROM `m_barang`
---
	public function account()
	{
		if (! $this->session->isLoggedIn) {
			return redirect()->to('login');
		}

		$customer = new Customer();

		// getall users
		$allcust = $customer->countAll();

		$barang = new Barang();

		// getall users
		$allbarang = $barang->countAll();