app/Controllers/Auth/CustomerController.php

SELECT *
FROM `m_customer`
SELECT COUNT(*) AS `numrows` FROM `m_customer`
SELECT COUNT(*) AS `numrows`
FROM `m_customer`
WHERE `created_at` LIKE '%2024-05%' ESCAPE '!'
---
public function customer()
	{
		// check if user is signed-in if not redirect to login page
		if (!$this->session->isLoggedIn) {
			return redirect()->to('login');
		}

		// current year and month variable
		$ym = date("Y-m");

		// load user model
		$customer = new Customer();

		// getall users
		$allcust = $customer->findAll();

		// count all rows in users table
		$countcust = $customer->countAll();

		// count all active user in the last 30 days
		$newcust = $customer->like("created_at", $ym)->countAllResults();