app/Controllers/Auth/TransaksiController.php

    public function transaksi()
    {
        // Check if the user is signed-in, if not redirect to the login page
        if (!$this->session->get('isLoggedIn')) {
            return redirect()->to('login');
        }

        // Load Transaksi model
        $transaksiModel = new Transaksi();

        // Get all transactions with related data using joins
        $alltrans = $transaksiModel
            ->select(['t_sales.id', 't_sales.kode', 't_sales.tgl', 'm_customer.nama as nama', 't_sales_detail.qty', 't_sales.subtotal', 't_sales.diskon', 't_sales.ongkir', 't_sales.total_bayar'], false)

            ->join('m_customer', 'm_customer.id = t_sales.id_cust')
            ->join('t_sales_detail', 't_sales_detail.id_sales = t_sales.id')
            ->join('m_barang', 'm_barang.id = t_sales_detail.id_barang')
            ->findAll();
---
SELECT t_sales.id, t_sales.kode, t_sales.tgl, m_customer.nama as nama, t_sales_detail.qty, t_sales.subtotal, t_sales.diskon, t_sales.ongkir, t_sales.total_bayar
FROM `t_sales`
JOIN `m_customer` ON `m_customer`.`id` = `t_sales`.`id_cust`
JOIN `t_sales_detail` ON `t_sales_detail`.`id_sales` = `t_sales`.`id`
JOIN `m_barang` ON `m_barang`.`id` = `t_sales_detail`.`id_barang`