app/Controllers/Auth/UsersController.php

SELECT *
FROM `users`
SELECT COUNT(*) AS `numrows` FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `created_at` LIKE '%2024-05%' ESCAPE '!'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `active` = 1
---
	public function users()
	{
		// check if user is signed-in if not redirect to login page
		if (! $this->session->isLoggedIn) {
			return redirect()->to('login');
		}

		// current year and month variable
		$ym = date("Y-m");

		// load user model
		$users = new UserModel();

		// getall users
		$allusers = $users->findAll();

		// count all rows in users table
		$countusers = $users->countAll();

		// count all active user in the last 30 days
		$newusers = $users->like("created_at", $ym)->countAllResults();

		// count all active users
		$activeusers = $users->where('active', 1)->countAllResults();