app/Controllers/Home.php

SELECT *
FROM `t_pengantin`
 LIMIT 1
SELECT *
FROM `t_grooms`
SELECT *
FROM `t_family`
---
     public function index()
    {
        $model = new T_Pengantin();
        $model2 = new T_Grooms();
        $model3 = new T_Family();


        $data['pengantin'] = $model->first();
        $data['grooms'] = $model2->findAll();
        $data['family'] = $model3->findAll();